*** Same, but punctuation included
#+begin_src python :results output
    import xml.etree.ElementTree as ET
    import re
    import os
    import json
    from glob import glob  # Allows processing multiple XML files
    
    # Define input and output directories
    xml_files = glob("/home/gnosis/Documents/au_work/main/corpora/opensource/swete_sep/*.xml")
    # Folder containing the split XML parts
    output_dir = "/home/gnosis/Documents/au_work/main/corpora/extract/Swete_punct"
    os.makedirs(output_dir, exist_ok=True)  # Ensure output directory exists

    # Define TEI XML namespace
    NAMESPACE = {"tei": "http://www.tei-c.org/ns/1.0"}

    # Function to clean and extract only Ancient Greek text (preserving punctuation)
    def extract_greek_text(text):
        """Removes all non-Greek characters except punctuation and diacritics."""
        return re.sub(r"[^\u0370-\u03FF\u1F00-\u1FFF\s.,;·()\[\]]", "", text).strip()

    # Function to extract bracketed text as variants
    def extract_variants(text):
        """Finds bracketed text and returns a list of text-critical variants."""
        return re.findall(r"\[(.*?)\]", text)  # Extract text inside brackets

    # Process each XML file separately
    for xml_file_path in xml_files:
        print(f"Processing: {xml_file_path}")
        
        # Load and parse the XML file
        tree = ET.parse(xml_file_path)
        root = tree.getroot()

        # Process each book separately
        for book in root.findall(".//tei:div[@type='book']", NAMESPACE):
            book_title_element = book.find("tei:head", NAMESPACE)  # Find book title
            book_title = book_title_element.text.strip() if book_title_element is not None else "Unknown_Book"

            # File names
            book_filename_clean = f"{book_title.replace(' ', '_')}_nlp_ready.txt"
            book_filename_variants = f"{book_title.replace(' ', '_')}_variants.jsonl"
            book_filename_marginal_notes = f"{book_title.replace(' ', '_')}_marginal_notes.jsonl"
            book_filename_human_readable = f"{book_title.replace(' ', '_')}_human_readable.txt"

            book_texts = []
            human_readable_texts = []
            variant_entries = []
            marginal_note_entries = []

            # Extract Greek text from paragraphs within the book
            for paragraph in book.findall(".//tei:p", NAMESPACE):
                verse_text = []
                
                # Iterate over elements inside <p> (words & punctuation)
                for element in paragraph:
                    if element.tag in ["{http://www.tei-c.org/ns/1.0}lb", "{http://www.tei-c.org/ns/1.0}pb"]:
                        # Preserve line breaks and page breaks for human-readable text
                        verse_text.append(f"[{element.tag} {element.attrib.get('n', '?')}] ")
                    elif element.tag == "{http://www.tei-c.org/ns/1.0}note":
                        # Handle text-critical notes separately
                        note_type = element.attrib.get("type", "")
                        note_text = "".join(element.itertext()).strip()
                        cleaned_note = extract_greek_text(note_text)

                        if cleaned_note:
                            if note_type == "marginal":
                                marginal_note_entries.append(json.dumps({
                                    "book": book_title,
                                    "note": cleaned_note
                                }, ensure_ascii=False))
                            elif note_type == "footnote":
                                variant_entries.append(json.dumps({
                                    "book": book_title,
                                    "context": "Footnote",
                                    "variants": [cleaned_note]
                                }, ensure_ascii=False))
                    elif element.tag == "{http://www.tei-c.org/ns/1.0}milestone":
                        # Capture verse references (e.g., stored in parentheses or brackets)
                        verse_ref = element.attrib.get("n", "?")
                        verse_text.append(f"({verse_ref}) ")
                    else:
                        # Extract text (words & punctuation together)
                        text = "".join(element.itertext()).strip()
                        if text:
                            verse_text.append(text)

                # Join words and punctuation properly
                full_text = " ".join(verse_text).strip()
                cleaned_text = extract_greek_text(full_text)
                
                # Extract text-critical variants
                variants = extract_variants(cleaned_text)
                
                # Store variants separately with context
                if variants:
                    variant_entries.append(json.dumps({
                        "book": book_title,
                        "context": full_text,
                        "variants": variants
                    }, ensure_ascii=False))

                # Remove bracketed text for the clean NLP version
                cleaned_text_nlp = re.sub(r"\[.*?\]", "", cleaned_text).strip()
                if cleaned_text_nlp:
                    book_texts.append(cleaned_text_nlp)

                # Add paragraph to the human-readable version, keeping brackets for variants
                human_readable_texts.append(full_text)

            # Append results to existing files (since XML is split into parts)
            with open(os.path.join(output_dir, book_filename_clean), "a", encoding="utf-8") as f:
                f.write("\n".join(book_texts) + "\n")

            with open(os.path.join(output_dir, book_filename_human_readable), "a", encoding="utf-8") as f:
                f.write("\n".join(human_readable_texts) + "\n")

            if variant_entries:
                with open(os.path.join(output_dir, book_filename_variants), "a", encoding="utf-8") as f:
                    f.write("\n".join(variant_entries) + "\n")

            if marginal_note_entries:
                with open(os.path.join(output_dir, book_filename_marginal_notes), "a", encoding="utf-8") as f:
                    f.write("\n".join(marginal_note_entries) + "\n")

            print(f"Processed: {book_title}")

    print("Processing complete! Cleaned texts, variants, and marginal notes saved separately.")
#+end_src

#+RESULTS:
: Processing: /home/gnosis/Documents/au_work/main/corpora/opensource/swete_sep/old_testament_1901_vol1.xml
: Processing: /home/gnosis/Documents/au_work/main/corpora/opensource/swete_sep/old_testament_1891_vol2.xml
: Processing: /home/gnosis/Documents/au_work/main/corpora/opensource/swete_sep/old_testament_1930_vol3.xml
: Processing complete! Cleaned texts, variants, and marginal notes saved separately.


**** Script
#+begin_src python :results output
import os
import xml.etree.ElementTree as ET

# Define the input directory containing XML files
input_dir = "/home/gnosis/Documents/au_work/main/corpora/opensource/SBLGNT-master/data/sblgnt/xml"  # Change this to your actual directory path

# Iterate over all XML files in the directory
for file_name in os.listdir(input_dir):
    if file_name.endswith(".xml"):
        file_path = os.path.join(input_dir, file_name)
        
        try:
            # Parse XML
            tree = ET.parse(file_path)
            root = tree.getroot()

            # Extract book title
            title_element = root.find("./title")
            title_text = title_element.text.strip() if title_element is not None else "❌ No title found"

            # Extract basename (without extension)
            base_name = os.path.splitext(file_name)[0]

            # Print comparison
            if base_name in title_text:
                print(f"✅ Match: {file_name} -> {title_text}")
            else:
                print(f"⚠️ Mismatch: {file_name} -> {title_text}")

        except ET.ParseError:
            print(f"❌ Error parsing {file_name}")

print("\nProcessing complete!")

#+end_src

#+RESULTS:
#+begin_example
⚠️ Mismatch: 1Cor.xml -> ΠΡΟΣ ΚΟΡΙΝΘΙΟΥΣ Α
⚠️ Mismatch: 1John.xml -> ΙΩΑΝΝΟΥ Α
⚠️ Mismatch: 1Pet.xml -> ΠΕΤΡΟΥ Α
⚠️ Mismatch: 1Thess.xml -> ΠΡΟΣ ΘΕΣΣΑΛΟΝΙΚΕΙΣ Α
⚠️ Mismatch: 1Tim.xml -> ΠΡΟΣ ΤΙΜΟΘΕΟΝ Α
⚠️ Mismatch: 2Cor.xml -> ΠΡΟΣ ΚΟΡΙΝΘΙΟΥΣ Β
⚠️ Mismatch: 2John.xml -> ΙΩΑΝΝΟΥ Β
⚠️ Mismatch: 2Pet.xml -> ΠΕΤΡΟΥ Β
⚠️ Mismatch: 2Thess.xml -> ΠΡΟΣ ΘΕΣΣΑΛΟΝΙΚΕΙΣ Β
⚠️ Mismatch: 2Tim.xml -> ΠΡΟΣ ΤΙΜΟΘΕΟΝ Β
⚠️ Mismatch: 3John.xml -> ΙΩΑΝΝΟΥ Γ
⚠️ Mismatch: Acts.xml -> ΠΡΑΞΕΙΣ ΑΠΟΣΤΟΛΩΝ
⚠️ Mismatch: Col.xml -> ΠΡΟΣ ΚΟΛΟΣΣΑΕΙΣ
⚠️ Mismatch: Eph.xml -> ΠΡΟΣ ΕΦΕΣΙΟΥΣ
⚠️ Mismatch: Gal.xml -> ΠΡΟΣ ΓΑΛΑΤΑΣ
⚠️ Mismatch: Heb.xml -> ΠΡΟΣ ΕΒΡΑΙΟΥΣ
⚠️ Mismatch: Jas.xml -> ΙΑΚΩΒΟΥ
⚠️ Mismatch: John.xml -> ΚΑΤΑ ΙΩΑΝΝΗΝ
⚠️ Mismatch: Jude.xml -> ΙΟΥΔΑ
⚠️ Mismatch: Luke.xml -> ΚΑΤΑ ΛΟΥΚΑΝ
⚠️ Mismatch: Mark.xml -> ΚΑΤΑ ΜΑΡΚΟΝ
⚠️ Mismatch: Matt.xml -> ΚΑΤΑ ΜΑΘΘΑΙΟΝ
⚠️ Mismatch: Phil.xml -> ΠΡΟΣ ΦΙΛΙΠΠΗΣΙΟΥΣ
⚠️ Mismatch: Phlm.xml -> ΠΡΟΣ ΦΙΛΗΜΟΝΑ
⚠️ Mismatch: Rev.xml -> ΑΠΟΚΑΛΥΨΙΣ ΙΩΑΝΝΟΥ
⚠️ Mismatch: Rom.xml -> ΠΡΟΣ ΡΩΜΑΙΟΥΣ
⚠️ Mismatch: Titus.xml -> ΠΡΟΣ ΤΙΤΟΝ

Processing complete!
#+end_example

**** v1
#+begin_src python :results output
  import os
  import pandas as pd
  import xml.etree.ElementTree as ET

  # Directories and files
  sblgnt_dir = "/home/gnosis/Documents/au_work/main/corpora/opensource/SBLGNT-master/data/sblgnt/xml"
  brenton_xml_file = "/home/gnosis/Documents/au_work/main/corpora/opensource/brent_sep/grcbrent_usfx/BookNames.xml"

  # Initialize list to store data
  book_data = []

  ### PROCESS SBLGNT ###
  for file_name in os.listdir(sblgnt_dir):
      if file_name.endswith(".xml"):
          file_path = os.path.join(sblgnt_dir, file_name)

          try:
              tree = ET.parse(file_path)
              root = tree.getroot()

              # Extract book abbreviation (from <book id="">)
              book_element = root.find("./book")
              # Correct way to extract the book id
              book_abbreviation = root.get("id", "❌ No ID")  # Directly access the attribute


              # Extract Greek title (from <title>)
              title_element = root.find("./title")
              greek_title = title_element.text.strip() if title_element is not None else "❌ No title"
              # Extract file name
              base_name = os.path.splitext(file_name)[0]
              # Append to list
              book_data.append(["SBLGNT", book_abbreviation, greek_title, "N/A"])  # No "Long Title" in SBLGNT

          except ET.ParseError:
              print(f"❌ Error parsing {file_name}")

  ### PROCESS BRENTON LXX ###
  tree = ET.parse(brenton_xml_file)
  root = tree.getroot()

  for book in root.findall("book"):
      book_abbreviation = book.get("code", "❌ No Code")
      greek_title = book.get("short", "❌ No Short Name")
      
      long_title = book.get("long", "❌ No Long Name")
      alt_name = book.get("alt", "")

      # Combine Long Title and Alternative Name
      long_or_alt = long_title if not alt_name else f"{long_title} OR {alt_name}"

      # Append to list
      book_data.append(["LXX_Brenton", book_abbreviation, greek_title, long_or_alt])

  # Convert to Pandas DataFrame
  df = pd.DataFrame(book_data, columns=["Source", "Book Abbreviation", "Greek Title", "Long Title OR Alternative Name"])

  # Save to CSV
  output_file = "book_data.csv"
  df.to_csv(output_file, index=False, encoding="utf-8")

  print(f"✅ Data saved to {output_file}")

#+end_src

#+RESULTS:
: ✅ Data saved to book_data.csv

**** v3 - .csv produced, NEED TO CHECK THROUGH
#+begin_src python :results output
import re
import difflib
import pandas as pd

# Function to remove parenthetical parts from a string
def remove_parentheticals(text):
    return re.sub(r"\s*\(.*?\)", "", text).strip()

# Function to split a cleanedlist title string into components
def parse_cleanedlist_title(title_str):
    """
    Expected format: "English Title - Abbreviation-Greek Title (extra info)"
    Returns a dict with keys:
      - english: part before first "-"
      - candidate_abbr: first part after "-" split by "-"
      - candidate_greek: second part after "-" with parentheticals removed (if present)
    """
    parts = title_str.split("-", 1)
    if len(parts) < 2:
        return {"english": title_str.strip(), "candidate_abbr": "", "candidate_greek": ""}
    english = parts[0].strip()
    remainder = parts[1].strip()
    # Now split remainder by "-" if possible:
    rem_parts = remainder.split("-", 1)
    candidate_abbr = rem_parts[0].strip()
    candidate_greek = ""
    if len(rem_parts) > 1:
        candidate_greek = remove_parentheticals(rem_parts[1].strip())
    return {"english": english, "candidate_abbr": candidate_abbr, "candidate_greek": candidate_greek}

# Read the cleanedlist.csv (assuming no headers, with two columns)
cleanedlist_path = "/home/gnosis/Documents/au_work/main/corpora/cleanedlist.csv"
cleaned_df = pd.read_csv(cleanedlist_path, header=None, names=["Metadata_ID", "Metadata_Title"])

# Parse the cleanedlist titles and add columns for easier matching
cleaned_df[['English_Part', 'Candidate_Abbr', 'Candidate_Greek']] = cleaned_df["Metadata_Title"].apply(
    lambda t: pd.Series(parse_cleanedlist_title(t))
)

# Read the book_data.csv (which should have columns: Source, Book Abbreviation, Greek Title, Long Title OR Alternative Name)
book_data_path = "/home/gnosis/Documents/au_work/main/comp_antiquity/combined_approach/extract/book_data.csv"
book_df = pd.read_csv(book_data_path)

# Function to compute a fuzzy matching ratio
def fuzzy_ratio(a, b):
    return difflib.SequenceMatcher(None, a.lower(), b.lower()).ratio()

# Function to find the best match for each book entry
def find_best_match_for_book(book_row, cleaned_df, cutoff=0.6):
    best_score = 0
    best_id = None
    best_title = None  # Store matched title
    
    # Get book data candidates (all strings)
    book_abbr = str(book_row["Book Abbreviation"]).strip()
    greek_title = str(book_row["Greek Title"]).strip()
    long_alt = str(book_row["Long Title OR Alternative Name"]).strip()
    
    # Loop over cleanedlist rows:
    for _, cl_row in cleaned_df.iterrows():
        scores = []
        # Compare candidate_abbr to book_abbr
        if cl_row["Candidate_Abbr"]:
            score1 = fuzzy_ratio(cl_row["Candidate_Abbr"], book_abbr)
            scores.append(score1)
        # Compare candidate_greek to greek_title
        if cl_row["Candidate_Greek"]:
            score2 = fuzzy_ratio(cl_row["Candidate_Greek"], greek_title)
            scores.append(score2)
            # Also compare candidate_greek to long_alt if available
            score3 = fuzzy_ratio(cl_row["Candidate_Greek"], long_alt)
            scores.append(score3)
        
        if scores:
            max_score = max(scores)
            if max_score > best_score and max_score >= cutoff:
                best_score = max_score
                best_id = cl_row["Metadata_ID"]
                best_title = cl_row["Metadata_Title"]  # Store matched title
    
    return best_id, best_title, best_score

# Apply matching to each book in book_df
matched_ids = []
matched_titles = []
match_scores = []
meta_id_names = []

for _, book_row in book_df.iterrows():
    best_id, best_title, score = find_best_match_for_book(book_row, cleaned_df, cutoff=0.6)
    
    matched_ids.append(best_id if best_id is not None else "No Match")
    matched_titles.append(best_title if best_title is not None else "No Match")
    match_scores.append(score)
    
    # Look up the actual title based on best_id
    if best_id and best_id in cleaned_df["Metadata_ID"].values:
        meta_id_name = cleaned_df.loc[cleaned_df["Metadata_ID"] == best_id, "Metadata_Title"].values[0]
    else:
        meta_id_name = "No Match"
    
    meta_id_names.append(meta_id_name)

# Add the new columns to book_df
book_df["Metadata_ID"] = matched_ids
book_df["Metadata_Title"] = matched_titles
book_df["Match_Score"] = match_scores
book_df["META_ID_NAME"] = meta_id_names  # Add the new column

# Save the updated book_df to a CSV file
output_file = "matched_book_data.csv"
book_df.to_csv(output_file, index=False, encoding="utf-8")

print("Matching complete. Results saved to:", output_file)
#+end_src

#+RESULTS:
: Matching complete. Results saved to: matched_book_data.csv

*** Script for renaming files with their correct id
#+begin_src python :results output
import os

# Define the mapping of filenames to Greek titles
greek_title_map = {
    "1Cor": "ΠΡΟΣ ΚΟΡΙΝΘΙΟΥΣ Α",
    "1John": "ΙΩΑΝΝΟΥ Α",
    "1Pet": "ΠΕΤΡΟΥ Α",
    "1Thess": "ΠΡΟΣ ΘΕΣΣΑΛΟΝΙΚΕΙΣ Α",
    "1Tim": "ΠΡΟΣ ΤΙΜΟΘΕΟΝ Α",
    "2Cor": "ΠΡΟΣ ΚΟΡΙΝΘΙΟΥΣ Β",
    "2John": "ΙΩΑΝΝΟΥ Β",
    "2Pet": "ΠΕΤΡΟΥ Β",
    "2Thess": "ΠΡΟΣ ΘΕΣΣΑΛΟΝΙΚΕΙΣ Β",
    "2Tim": "ΠΡΟΣ ΤΙΜΟΘΕΟΝ Β",
    "3John": "ΙΩΑΝΝΟΥ Γ",
    "Acts": "ΠΡΑΞΕΙΣ ΑΠΟΣΤΟΛΩΝ",
    "Col": "ΠΡΟΣ ΚΟΛΟΣΣΑΕΙΣ",
    "Eph": "ΠΡΟΣ ΕΦΕΣΙΟΥΣ",
    "Gal": "ΠΡΟΣ ΓΑΛΑΤΑΣ",
    "Heb": "ΠΡΟΣ ΕΒΡΑΙΟΥΣ",
    "Jas": "ΙΑΚΩΒΟΥ",
    "John": "ΚΑΤΑ ΙΩΑΝΝΗΝ",
    "Jude": "ΙΟΥΔΑ",
    "Luke": "ΚΑΤΑ ΛΟΥΚΑΝ",
    "Mark": "ΚΑΤΑ ΜΑΡΚΟΝ",
    "Matt": "ΚΑΤΑ ΜΑΘΘΑΙΟΝ",
    "Phil": "ΠΡΟΣ ΦΙΛΙΠΠΗΣΙΟΥΣ",
    "Phlm": "ΠΡΟΣ ΦΙΛΗΜΟΝΑ",
    "Rev": "ΑΠΟΚΑΛΥΨΙΣ ΙΩΑΝΝΟΥ",
    "Rom": "ΠΡΟΣ ΡΩΜΑΙΟΥΣ",
    "Titus": "ΠΡΟΣ ΤΙΤΟΝ"
}

# Define the root directory containing the files
root_dir = "/home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct"  # Change this to your actual directory

# Iterate through all subdirectories and files
for dirpath, _, filenames in os.walk(root_dir):
    for file_name in filenames:
        # Extract the file prefix before the first "_"
        base_name, ext = os.path.splitext(file_name)

        # Split at "_" to check for a known book abbreviation
        parts = base_name.split("_", 1)
        if len(parts) < 2:
            continue  # Skip files that don't match the pattern
        
        book_prefix, suffix = parts  # Example: "Titus", "nlp_ready"
        
        # Check if the book prefix exists in the mapping
        if book_prefix in greek_title_map:
            new_name = f"{greek_title_map[book_prefix]}_{suffix}{ext}"  # Preserve suffix and extension
            old_path = os.path.join(dirpath, file_name)
            new_path = os.path.join(dirpath, new_name)

            # Rename the file
            os.rename(old_path, new_path)
            print(f"Renamed in {dirpath}: {file_name} -> {new_name}")

print("\n✅ Renaming complete across all subdirectories!")
#+end_src

#+RESULTS:
#+begin_example
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: 1Cor_nlp_ready.txt -> ΠΡΟΣ ΚΟΡΙΝΘΙΟΥΣ Α_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: 1John_nlp_ready.txt -> ΙΩΑΝΝΟΥ Α_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: 1Pet_nlp_ready.txt -> ΠΕΤΡΟΥ Α_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: 1Thess_nlp_ready.txt -> ΠΡΟΣ ΘΕΣΣΑΛΟΝΙΚΕΙΣ Α_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: 1Tim_nlp_ready.txt -> ΠΡΟΣ ΤΙΜΟΘΕΟΝ Α_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: 2Cor_nlp_ready.txt -> ΠΡΟΣ ΚΟΡΙΝΘΙΟΥΣ Β_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: 2John_nlp_ready.txt -> ΙΩΑΝΝΟΥ Β_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: 2Pet_nlp_ready.txt -> ΠΕΤΡΟΥ Β_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: 2Thess_nlp_ready.txt -> ΠΡΟΣ ΘΕΣΣΑΛΟΝΙΚΕΙΣ Β_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: 2Tim_nlp_ready.txt -> ΠΡΟΣ ΤΙΜΟΘΕΟΝ Β_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: 3John_nlp_ready.txt -> ΙΩΑΝΝΟΥ Γ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Acts_nlp_ready.txt -> ΠΡΑΞΕΙΣ ΑΠΟΣΤΟΛΩΝ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Col_nlp_ready.txt -> ΠΡΟΣ ΚΟΛΟΣΣΑΕΙΣ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Eph_nlp_ready.txt -> ΠΡΟΣ ΕΦΕΣΙΟΥΣ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Gal_nlp_ready.txt -> ΠΡΟΣ ΓΑΛΑΤΑΣ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Heb_nlp_ready.txt -> ΠΡΟΣ ΕΒΡΑΙΟΥΣ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Jas_nlp_ready.txt -> ΙΑΚΩΒΟΥ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: John_nlp_ready.txt -> ΚΑΤΑ ΙΩΑΝΝΗΝ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Jude_nlp_ready.txt -> ΙΟΥΔΑ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Luke_nlp_ready.txt -> ΚΑΤΑ ΛΟΥΚΑΝ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Mark_nlp_ready.txt -> ΚΑΤΑ ΜΑΡΚΟΝ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Matt_nlp_ready.txt -> ΚΑΤΑ ΜΑΘΘΑΙΟΝ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Phil_nlp_ready.txt -> ΠΡΟΣ ΦΙΛΙΠΠΗΣΙΟΥΣ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Phlm_nlp_ready.txt -> ΠΡΟΣ ΦΙΛΗΜΟΝΑ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Rev_nlp_ready.txt -> ΑΠΟΚΑΛΥΨΙΣ ΙΩΑΝΝΟΥ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Rom_nlp_ready.txt -> ΠΡΟΣ ΡΩΜΑΙΟΥΣ_nlp_ready.txt
Renamed in /home/gnosis/Documents/au_work/main/corpora/extract/SBLGNT_punct: Titus_nlp_ready.txt -> ΠΡΟΣ ΤΙΤΟΝ_nlp_ready.txt

✅ Renaming complete across all subdirectories!
#+end_example
